ryankurte/efm32-base/emdrv/tempdrv/src/tempdrv.c
/***************************************************************************//**
 * @file
 * @brief TEMPDRV API implementation.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.  This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "em_device.h"
#include "em_system.h"
#include "em_emu.h"
#include "string.h"

#include "tempdrv.h"

typedef struct {
  TEMPDRV_Callback_t callback;    ///< Callback function
  uint8_t temp;                   ///< Limit temperature (EMU value)
} TEMPDRV_CallbackSet_t;

#if defined(_SILICON_LABS_GECKO_INTERNAL_SDID_80)
#define TEMPDRV_ERRATA_FIX
#endif

#ifdef TEMPDRV_ERRATA_FIX
#define TEMPDRV_INT_CALLBACK_DEPTH 1
#define TEMPDRV_
#else
#define TEMPDRV_INT_CALLBACK_DEPTH 0
#endif

#define TEMPDRV_CALLBACK_DEPTH (TEMPDRV_INT_CALLBACK_DEPTH + TEMPDRV_CUSTOM_CALLBACK_DEPTH)
#define TEMPDRV_CUSTOM_CALLBACK_INDEX TEMPDRV_INT_CALLBACK_DEPTH

#if defined(_SILICON_LABS_32B_SERIES_1)
// On Series-1 devices the temperature code is inverted. (high value = low temperature)
#define INCREASING_TEMPERATURE_FLAG   EMU_IF_TEMPLOW
#define DECREASING_TEMPERATURE_FLAG   EMU_IF_TEMPHIGH
#else
// On Series-2 devices the temperature code is normal. (high value = high temperature)
#define INCREASING_TEMPERATURE_FLAG   EMU_IF_TEMPHIGH
#define DECREASING_TEMPERATURE_FLAG   EMU_IF_TEMPLOW
#endif

static TEMPDRV_CallbackSet_t tempdrvHighCallbacks[TEMPDRV_CALLBACK_DEPTH];
static TEMPDRV_CallbackSet_t tempdrvLowCallbacks[TEMPDRV_CALLBACK_DEPTH];
static TEMPDRV_CallbackSet_t nullCallback = { NULL, 0 };
static TEMPDRV_CallbackSet_t *highCallback;
static TEMPDRV_CallbackSet_t *lowCallback;

static bool TEMPDRV_InitState = false;
static bool TEMPDRV_EnableState = false;

static int convertToTemp(uint32_t emu);
static uint32_t convertToEmu(int temp);
static void updateInterrupts(void);

#if defined(_DEVINFO_CAL_TEMP_MASK)
// Calibration values to be initialized in TEMPDRV_Init
static int calibrationEMU;
static int calibrationTEMP;
// Fallback calibration values in case DI calibration data not present
static uint8_t fallbackEMU = 0x90;
static uint8_t fallbackTEMP = 25;
#endif

#if (EMU_CUSTOM_IRQ_HANDLER == false)
/***************************************************************************//**
 * @brief
 *   EMU Interrupt Handler
 *
 * @details
 *   The EMU_IRQHandler provided by TEMPDRV will call @ref TEMPDRV_IRQ_Handler.
 *   Configure EMU_CUSTOM_IRQ_HANDLER = true if the application wants to
 *   implement its own EMU_IRQHandler. This is typically needed if one of the
 *   non-temperature related EMU interrupt flags are in use.
 ******************************************************************************/
void EMU_IRQHandler(void)
{
  TEMPDRV_IRQHandler();
}
#endif

/***************************************************************************//**
 * @brief
 *   TEMPDRV Interrupt Handler
 *
 * @details
 *   This function must be called by the EMU interrupt handler in order to
 *   support the TEMPDRV callback mechanism.
 *
 *   This function handles the @ref EMU_IF_TEMPHIGH, @ref EMU_IF_TEMPLOW
 *   interrupt flags from the EMU internal temperature sensor.
 ******************************************************************************/
void TEMPDRV_IRQHandler(void)
{
  uint32_t flags = EMU_IntGetEnabled();
  TEMPDRV_Callback_t activeCallback;

  if (flags & DECREASING_TEMPERATURE_FLAG) {
    if (lowCallback->callback != NULL) {
      activeCallback = lowCallback->callback;
      memset(lowCallback, 0, sizeof(TEMPDRV_CallbackSet_t));
      activeCallback(TEMPDRV_GetTemp(), TEMPDRV_LIMIT_LOW);
    }
    EMU_IntClear(DECREASING_TEMPERATURE_FLAG);
  } else if (flags & INCREASING_TEMPERATURE_FLAG) {
    if (highCallback->callback != NULL) {
      activeCallback = highCallback->callback;
      memset(highCallback, 0, sizeof(TEMPDRV_CallbackSet_t));
      activeCallback(TEMPDRV_GetTemp(), TEMPDRV_LIMIT_HIGH);
    }
    EMU_IntClear(INCREASING_TEMPERATURE_FLAG);
  }

  updateInterrupts();
}

#if defined(TEMPDRV_ERRATA_FIX)
/* Errata */
typedef enum ErrataState {
  ERRATA_LOW     = 0, /**< Low temperature <65&deg;C. */
  ERRATA_MID     = 1, /**< Medium temperature >65&deg;C and <80&deg;C. */
  ERRATA_HIGH    = 2  /**< High temperature >80&deg;C. */
} ErrataState_t;

// These are the temperature limits in degrees Celsius
#define ERRATA_MID_LIMIT   65
#define ERRATA_HIGH_LIMIT  80
#define ERRATA_HYSTERESIS   8

static void errataCallback(int8_t temp, TEMPDRV_LimitType_t limit);
static void errataStateUpdate(int8_t temp);

static TEMPDRV_CallbackSet_t errataLowTemp[3];  // Temperature decrease thresholds
static TEMPDRV_CallbackSet_t errataHighTemp[3]; // Temperature increase thresholds

/***************************************************************************//**
 * @brief
 *   Errata Callback
 *
 * @details
 *   This function is called by the TEMPDRV_IRQHandler and will change the
 *   state depending on the current temperature.
 ******************************************************************************/
static void errataCallback(int8_t temp, TEMPDRV_LimitType_t limit)
{
  (void) limit; // unused
  errataStateUpdate(temp);
}

/***************************************************************************//**
 * @brief
 *   Errata State Update
 *
 * @details
 *   Updates registers based on the current temperature
 ******************************************************************************/
static void errataStateUpdate(int8_t temp)
{
  ErrataState_t errataState;
  bool emuLocked = (EMU->LOCK == EMU_LOCK_LOCKKEY_LOCKED);

  // Figure out the current state based on temperature
  if (temp < ERRATA_MID_LIMIT) {
    errataState = ERRATA_LOW;
  } else if (temp < ERRATA_HIGH_LIMIT) {
    errataState = ERRATA_MID;
  } else {
    errataState = ERRATA_HIGH;
  }

  // Activate callback and thresholds for the current state
  tempdrvHighCallbacks[0] = errataHighTemp[errataState];
  tempdrvLowCallbacks[0] = errataLowTemp[errataState];

  if (emuLocked) {
    EMU->LOCK = EMU_LOCK_LOCKKEY_UNLOCK;
  }

  switch (errataState) {
    case ERRATA_LOW:
      EMU_SetBiasMode(emuBiasMode_1KHz);
      break;
    case ERRATA_MID:
      EMU_SetBiasMode(emuBiasMode_4KHz);
      break;
    case ERRATA_HIGH:
      EMU_SetBiasMode(emuBiasMode_Continuous);
      break;
  }

  if (emuLocked) {
    EMU->LOCK = EMU_LOCK_LOCKKEY_LOCK;
  }
}

/***************************************************************************//**
 * @brief
 *   Errata Initialization
 *
 * @details
 *   Initialize the temperature thresholds based on calibration values and
 *   initializes the errata fix based on the current temperature.
 ******************************************************************************/
static void errataInit(void)
{
  SYSTEM_ChipRevision_TypeDef rev;
  SYSTEM_ChipRevisionGet(&rev);

  /* Rev A temp errata handling */
  if (rev.major == 0x01) {
    uint8_t limitLow;
    uint8_t limitHigh;

    // Initialize Low temperature state [*, 65]
    limitHigh = convertToEmu(ERRATA_MID_LIMIT);
    errataHighTemp[ERRATA_LOW].temp = limitHigh;
    errataHighTemp[ERRATA_LOW].callback = errataCallback;

