ryankurte/efm32-base/emdrv/tempdrv/src/tempdrv.c
    // Initialize Mid temperature state [57, 80]
    limitLow  = convertToEmu(ERRATA_MID_LIMIT - ERRATA_HYSTERESIS);
    limitHigh = convertToEmu(ERRATA_HIGH_LIMIT);
    errataLowTemp[ERRATA_MID].temp = limitLow;
    errataLowTemp[ERRATA_MID].callback = errataCallback;
    errataHighTemp[ERRATA_MID].temp = limitHigh;
    errataHighTemp[ERRATA_MID].callback = errataCallback;

    // Initialize High temperature state [72, *]
    limitLow = convertToEmu(ERRATA_HIGH_LIMIT - ERRATA_HYSTERESIS);
    errataLowTemp[ERRATA_HIGH].temp = limitLow;
    errataLowTemp[ERRATA_HIGH].callback = errataCallback;

    errataStateUpdate(TEMPDRV_GetTemp());
  }
}
#else // TEMPDRV_ERRATA_FIX

#define errataInit()

#endif // TEMPDRV_ERRATA_FIX

/* Internal Functions */
/***************************************************************************//**
 * @brief
 *   Find an empty spot for callback in set
 *
 * @param[in] set
 *   Callback set to search
 *
 * @return
 *   index of empty space if found, -1 if none
 ******************************************************************************/
static int8_t findCallbackSpace(TEMPDRV_CallbackSet_t *set)
{
  uint8_t index;
  for (index = TEMPDRV_CUSTOM_CALLBACK_INDEX; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    if (set[index].callback == NULL) {
      return index;
    }
  }
  // no empty space, return -1
  return -1;
}

/***************************************************************************//**
 * @brief
 *   Attempt to add a callback to a set
 *
 * @param[in] set
 *   Callback set to add callback to
 *
 * @param[in] temp
 *   Temperature to register callback at
 *
 * @param[in] callback
 *   Callback function
 *
 * @return
 *    @li @ref ECODE_EMDRV_TEMPDRV_OK on success.
 *    @li @ref ECODE_EMDRV_TEMPDRV_NO_SPACE if there is no space left for
 *        callbacks.
 ******************************************************************************/
static Ecode_t addCallback(TEMPDRV_CallbackSet_t *set,
                           int8_t temp,
                           TEMPDRV_Callback_t callback)
{
  int8_t index = findCallbackSpace(set);
  if (index < 0) {
    return ECODE_EMDRV_TEMPDRV_NO_SPACE;
  }
  set[index].temp = convertToEmu(temp);
  set[index].callback = callback;
  updateInterrupts();
  return ECODE_EMDRV_TEMPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *   Remove a callback from the set
 *
 * @param[in] set
 *   Callback set to remove callback from
 *
 * @param[in] callback
 *   Callback function
 *
 * @return
 *   @c true on success and @c false if the callback was not found.
 ******************************************************************************/
static bool removeCallback(TEMPDRV_CallbackSet_t *set,
                           TEMPDRV_Callback_t callback)
{
  bool found = false;
  uint8_t index;
  for (index = TEMPDRV_CUSTOM_CALLBACK_INDEX; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    if (set[index].callback == callback) {
      set[index].callback = NULL;
      set[index].temp = 0;
      found = true;
    }
  }
  updateInterrupts();
  return found;
}

/***************************************************************************//**
 * @brief
 *   Check if another callback has registered the same temperature
 *
 * @param[in] set
 *   Callback set to search
 *
 * @param[in] temp
 *   Temperature to match
 *
 * @return
 *    @c true if a duplicate is found, @c false if no duplicates is found.
 ******************************************************************************/
static bool checkForDuplicates(TEMPDRV_CallbackSet_t *set, int8_t temp)
{
  uint8_t index;
  uint8_t emu = convertToEmu(temp);
  for (index = TEMPDRV_CUSTOM_CALLBACK_INDEX; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    // filter out only entries with valid callbacks
    if (set[index].callback != NULL) {
      // if duplicate temperature, return true
      if (set[index].temp == emu) {
        return true;
      }
    }
  }
  // return false if no duplicate temperatures found
  return false;
}

/***************************************************************************//**
 * @brief
 *   Convert EMU value to degrees Celsius
 *
 * @param[in] emu
 *   EMU value to convert
 *
 * @return
 *    temperature in degrees Celsius
 ******************************************************************************/
static int convertToTemp(uint32_t emu)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  return (int)emu - 273; // Convert from Kelvin to Celsius
#else
  int res = (int) calibrationTEMP - ((emu * 8) / 5);
  // Cap conversion results at int8_t bounds
  if (res < -128) {
    res = -128;
  } else if (res > 127) {
    res = 127;
  }

  return (int8_t) res;
#endif
}

/***************************************************************************//**
 * @brief
 *   Convert a temperature in &deg;C to an EMU sensor value
 *
 * @param[in] temp
 *   Temperature to convert in degrees Celsius
 *
 * @return
 *   EMU temperature sensor value that represents the given temperature
 ******************************************************************************/
static uint32_t convertToEmu(int temp)
{
#if defined(_SILICON_LABS_32B_SERIES_2)
  return (uint32_t)(temp + 273); // Convert from Celsius to Kelvin
#else
  int32_t res = (int32_t) calibrationEMU -  ((temp * 5) >> 3);
  // Cap conversion results at uint8_t bounds
  if (res > 255) {
    res = 255;
  } else if (res < 0) {
    res = 0;
  }
  return (uint8_t) res;
#endif
}

/***************************************************************************//**
 * @brief
 *   Turn off and clear EMU temperature related interrupts
 ******************************************************************************/
static void disableInterrupts(void)
{
  EMU_IntClear(EMU_IF_TEMPLOW | EMU_IF_TEMPHIGH);
  EMU_IntDisable(EMU_IF_TEMPLOW | EMU_IF_TEMPHIGH);
}

/***************************************************************************//**
 * @brief
 *   Update interrupts based on active callbacks
 *
 * @details
 *   There can only be two temperature thresholds active in the EMU sensor at a
 *   single point in time. One threshold for increasing temperature and one
 *   threshold for decreasing temperature. The responsibility of this function
 *   is to always select which temperature thresholds that should be activated
 *   in the EMU sensor at any given time.
 ******************************************************************************/
static void updateInterrupts(void)
{
  int index;

