ryankurte/efm32-base/emdrv/tempdrv/src/tempdrv.c
  // Find lowest temperature active high callback
  for (index = 0; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    // filter out only entries with valid callbacks
    if (tempdrvHighCallbacks[index].callback != NULL) {
      if (highCallback->callback == NULL) {
        highCallback = &tempdrvHighCallbacks[index];
      } else {
        if (tempdrvHighCallbacks[index].temp > highCallback->temp) {
          highCallback = &tempdrvHighCallbacks[index];
        }
      }
    }
  }

  // Find highest temperature active low callback
  for (index = 0; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    // filter out only entries with valid callbacks
    if (tempdrvLowCallbacks[index].callback != NULL) {
      if (lowCallback->callback == NULL) {
        lowCallback = &tempdrvLowCallbacks[index];
      } else {
        if (tempdrvLowCallbacks[index].temp < lowCallback->temp) {
          lowCallback = &tempdrvLowCallbacks[index];
        }
      }
    }
  }

#if defined(_SILICON_LABS_32B_SERIES_1)
  // On Series-1 devices the temperature code is inverted (high value = low temperature)
  if (highCallback->callback != NULL) {
    EMU->TEMPLIMITS = (EMU->TEMPLIMITS & ~_EMU_TEMPLIMITS_TEMPLOW_MASK)
                      | (highCallback->temp << _EMU_TEMPLIMITS_TEMPLOW_SHIFT);
    EMU_IntEnable(EMU_IEN_TEMPLOW);
  } else {
    EMU_IntDisable(EMU_IEN_TEMPLOW);
  }
  if (lowCallback->callback != NULL) {
    EMU->TEMPLIMITS = (EMU->TEMPLIMITS & ~_EMU_TEMPLIMITS_TEMPHIGH_MASK)
                      | (lowCallback->temp << _EMU_TEMPLIMITS_TEMPHIGH_SHIFT);
    EMU_IntEnable(EMU_IEN_TEMPHIGH);
  } else {
    EMU_IntDisable(EMU_IEN_TEMPHIGH);
  }
#else
  // On Series-2 devices the temperature code is normal (high value = high temperature)
  if (highCallback->callback != NULL) {
    EMU->TEMPLIMITS = (EMU->TEMPLIMITS & ~_EMU_TEMPLIMITS_TEMPHIGH_MASK)
                      | (highCallback->temp << _EMU_TEMPLIMITS_TEMPHIGH_SHIFT);
    EMU_IntEnable(EMU_IEN_TEMPHIGH);
  } else {
    EMU_IntDisable(EMU_IEN_TEMPHIGH);
  }
  if (lowCallback->callback != NULL) {
    EMU->TEMPLIMITS = (EMU->TEMPLIMITS & ~_EMU_TEMPLIMITS_TEMPLOW_MASK)
                      | (lowCallback->temp << _EMU_TEMPLIMITS_TEMPLOW_SHIFT);
    EMU_IntEnable(EMU_IEN_TEMPLOW);
  } else {
    EMU_IntDisable(EMU_IEN_TEMPLOW);
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Prepare calibration values for temperature conversion.
 ******************************************************************************/
static void calibration(void)
{
#if defined(_DEVINFO_CAL_TEMP_MASK)
  uint32_t DItemp, DIemu;

  // Retrieve calibration data from DI page
  DItemp = ((DEVINFO->CAL & _DEVINFO_CAL_TEMP_MASK) >> _DEVINFO_CAL_TEMP_SHIFT);
  DIemu = ((DEVINFO->EMUTEMP & _DEVINFO_EMUTEMP_EMUTEMPROOM_MASK) >> _DEVINFO_EMUTEMP_EMUTEMPROOM_SHIFT);

  if ((DItemp == (_DEVINFO_CAL_TEMP_MASK >> _DEVINFO_CAL_TEMP_SHIFT))
      || (DIemu == (_DEVINFO_EMUTEMP_EMUTEMPROOM_MASK >> _DEVINFO_EMUTEMP_EMUTEMPROOM_SHIFT))) {
    // Missing DI page calibration data, substitute fixed values
    DItemp = fallbackTEMP;
    DIemu = fallbackEMU;
  }

  // calculate conversion offsets. Based on assumed slope of 5/8
  calibrationEMU = (DIemu) + ((5 * (DItemp)) / 8);
  calibrationTEMP = (DItemp) + (8 * (DIemu) / 5);
#endif
}

/* Official API */
/***************************************************************************//**
 * @brief
 *   Initialize the TEMP driver.
 *
 * @details
 *   This will clear all the registered callbacks and enable the EMU IRQ in the
 *   NVIC. Calling this function will also enable the EMU_E201 errata fix for
 *   first generation Pearl, Jade and EFR32 devices.
 *
 * @return
 *   @ref ECODE_EMDRV_TEMPDRV_OK on success.
 ******************************************************************************/
Ecode_t TEMPDRV_Init(void)
{
  // Flag up
  TEMPDRV_InitState = true;

  // reset stack state by erasing callbacks
  memset(tempdrvHighCallbacks, 0, sizeof (TEMPDRV_CallbackSet_t) * TEMPDRV_CALLBACK_DEPTH);
  memset(tempdrvLowCallbacks, 0, sizeof (TEMPDRV_CallbackSet_t) * TEMPDRV_CALLBACK_DEPTH);
  highCallback = &nullCallback;
  lowCallback = &nullCallback;

  calibration();
  errataInit();
  disableInterrupts();
  NVIC_ClearPendingIRQ(EMU_IRQn);
  NVIC_EnableIRQ(EMU_IRQn);
  updateInterrupts();

  return ECODE_EMDRV_TEMPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *    De-initialize the TEMP driver.
 *
 * @details
 *   This will clear all the registered callbacks and disable the EMU IRQ in
 *   the NVIC.
 *
 * @return
 *    @ref ECODE_EMDRV_TEMPDRV_OK on success.
 ******************************************************************************/
Ecode_t TEMPDRV_DeInit(void)
{
  TEMPDRV_InitState = false;
  NVIC_DisableIRQ(EMU_IRQn);
  NVIC_ClearPendingIRQ(EMU_IRQn);
  disableInterrupts();
  memset(tempdrvHighCallbacks, 0, sizeof (TEMPDRV_CallbackSet_t) * TEMPDRV_CALLBACK_DEPTH);
  memset(tempdrvLowCallbacks, 0, sizeof (TEMPDRV_CallbackSet_t) * TEMPDRV_CALLBACK_DEPTH);
  return ECODE_EMDRV_TEMPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *   Enable or disable the TEMP driver.
 *
 * @param[in] enable
 *   true to enable the TEMP driver, false to disable the TEMP driver.
 *
 * @return
 *   @ref ECODE_EMDRV_TEMPDRV_OK on success.
 ******************************************************************************/
Ecode_t TEMPDRV_Enable(bool enable)
{
  if (TEMPDRV_EnableState != enable) {
    TEMPDRV_EnableState = enable;
    if (enable) {
      updateInterrupts();
    } else {
      disableInterrupts();
    }
  }
  return ECODE_EMDRV_TEMPDRV_OK;
}

/***************************************************************************//**
 * @brief
 *   Get the number of active callbacks for a limit.
 *
 * @param[in] limit
 *   Limit type, refer to @ref TEMPDRV_LimitType_t.
 *
 * @return
 *   Number of active callbacks
 ******************************************************************************/
uint8_t TEMPDRV_GetActiveCallbacks(TEMPDRV_LimitType_t limit)
{
  TEMPDRV_CallbackSet_t *set;

  if (limit == TEMPDRV_LIMIT_HIGH) {
    // Define callback set
    set = tempdrvHighCallbacks;
  } else if (limit == TEMPDRV_LIMIT_LOW) {
    // Define callback set
    set = tempdrvLowCallbacks;
  } else {
    // Invalid limit
    return 0;
  }
  uint8_t index, count = 0;
  for (index = TEMPDRV_CUSTOM_CALLBACK_INDEX; index < TEMPDRV_CALLBACK_DEPTH; index++) {
    // filter out only entries with valid callbacks
    if (set[index].callback != NULL) {
      count++;
    }
  }
  return count;
}

/***************************************************************************//**
 * @brief
 *    Get the current temperature.
 *
 * @return
 *    Current temperature in degrees Celsius.
 ******************************************************************************/
int8_t TEMPDRV_GetTemp(void)
{
  uint32_t val = (EMU->TEMP & _EMU_TEMP_TEMP_MASK)
                 >> _EMU_TEMP_TEMP_SHIFT;
  return convertToTemp(val);
}

/***************************************************************************//**
 * @brief
 *   Register a callback in the TEMP driver
 *
 * @details
 *   This function is used for registering an application callback when the
 *   temperature changes. Note that when calling this function an application
 *   must specify the direction of the temperature change, use
 *   @ref TEMPDRV_LIMIT_LOW to receive a callback when the temperature drops
 *   below the specified temp and use @ref TEMPDRV_LIMIT_HIGH to receive a
 *   callback when the temperature increases above the specified temp.
 *
 * @note
 *   The user registered callback will be cleared once it's called. This means
 *   that the callback functions are not persistent, and have to be managed by
 *   the application. This feature can be used to implement a user controlled
 *   hysteresis. So for instance to register a callback at 50&deg;C with a
 *   5&deg;C hysteresis you can first register a callback at 50&deg;C or above
 *   using this function, and when the callback fires you can use this function
 *   again to register a callback when the temperature decreases to 45&deg;C or
 *   below. Each time a callback fires you only need to call the
 *   @ref TEMPDRV_RegisterCallback() function, there is no need to call
 *   @ref TEMPDRV_UnregisterCallback().
 *
 * @details
 *   It's important to know the current temperature before calling this
 *   function. Attempting to register a callback that would fire immediately
 *   is not supported and will result in a return value of
 *   @ref ECODE_EMDRV_TEMPDRV_BAD_LIMIT. Examples of an illegal scenario would
 *   be to register a callback for a temperature that is higher than the current
 *   temperature and with a limit set to @ref TEMPDRV_LIMIT_LOW.
 *
 * @param[in] temp
 *   Temperature to trigger on given in number of &deg;C.
 *
 * @param[in] limit
 *   Limit type, refer to @ref TEMPDRV_LimitType_t. Using @ref TEMPDRV_LIMIT_LOW
 *   will register a callback when the EMU temperature reaches @ref temp &deg;C
 *   or lower, and using @ref TEMPDRV_LIMIT_HIGH will register a callback when
 *   the EMU temperature reaches @ref temp &deg;C or higher.
 *
 * @param[in] callback
 *   User defined function to call when temperature threshold is reached or passed.
 *
 * @return
 *   @li @ref ECODE_EMDRV_TEMPDRV_OK on success.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_PARAM_ERROR if the callback is NULL.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_NO_INIT if the user has forgot to call @ref
 *     TEMPDRV_Init() before attempting to register a callback.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_BAD_LIMIT is returned if @ref temp is below the
 *     current temperature and @limit is @ref TEMPDRV_LIMIT_LOW. It is also
 *     returned if @ref temp is above the current temperature and @limit is
 *     @ref TEMPDRV_LIMIT_HIGH.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_DUP_TEMP is returned if a duplicate callback
 *     is detected. A duplicate callback is if you attempt to register a new
 *     callback with the same @ref temp and the same @ref limit as some
 *     already registered callback.
 ******************************************************************************/
Ecode_t TEMPDRV_RegisterCallback(int8_t temp,
                                 TEMPDRV_LimitType_t limit,
                                 TEMPDRV_Callback_t callback)
{
  TEMPDRV_CallbackSet_t *set;
  if (TEMPDRV_InitState == false) {
    return ECODE_EMDRV_TEMPDRV_NO_INIT;
  }
  // cannot register null callback
  if (callback == NULL) {
    return ECODE_EMDRV_TEMPDRV_PARAM_ERROR;
  }
  if (limit == TEMPDRV_LIMIT_HIGH) {
    // current temperature is already higher than requested temperature
    if (TEMPDRV_GetTemp() > temp) {
      return ECODE_EMDRV_TEMPDRV_BAD_LIMIT;
    }
    // Define callback set
    set = tempdrvHighCallbacks;
  } else if (limit == TEMPDRV_LIMIT_LOW) {
    // current temperature is already lower than requested temperature
    if (TEMPDRV_GetTemp() < temp) {
      return ECODE_EMDRV_TEMPDRV_BAD_LIMIT;
    }
    // Define callback set
    set = tempdrvLowCallbacks;
  } else {
    // Invalid limit
    return ECODE_EMDRV_TEMPDRV_PARAM_ERROR;
  }

  // Cannot register duplicate temperature callback
  if (checkForDuplicates(set, temp) == true) {
    return ECODE_EMDRV_TEMPDRV_DUP_TEMP;
  }

  return addCallback(set, temp, callback);
}

/***************************************************************************//**
 * @brief
 *   Unregister a callback in the TEMP driver.
 *
 * @param[in] callback
 *   Callback to unregister.
 *
 * @return
 *   @li @ref ECODE_EMDRV_TEMPDRV_OK on success.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_PARAM_ERROR if the callback is NULL.
 *
 *   @li @ref ECODE_EMDRV_TEMPDRV_NO_CALLBACK if the callback was not found.
 ******************************************************************************/
Ecode_t TEMPDRV_UnregisterCallback(TEMPDRV_Callback_t callback)
{
  // cannot register null callback
  if (callback == NULL) {
    return ECODE_EMDRV_TEMPDRV_PARAM_ERROR;
  }
  if (removeCallback(tempdrvHighCallbacks, callback) == false
      && removeCallback(tempdrvLowCallbacks, callback) == false) {
    return ECODE_EMDRV_TEMPDRV_NO_CALLBACK;
  }
  return ECODE_EMDRV_TEMPDRV_OK;
}

/* *INDENT-OFF* */
/******** THE REST OF THE FILE IS DOCUMENTATION ONLY !**********************//**
 * @addtogroup emdrv
 * @{
 * @addtogroup TEMPDRV
 * @brief TEMPDRV Temperature Sensor Driver
 * @{

